# Currency Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Currency Property
UnitTypeId Class See Also
---
Currency.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Currency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Currency As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Currency {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace